import "./terms.css";
import Header from "../../components/header/header";
import Footer from "../../components/footer/Footer";
import { useState } from "react";
function Terms() {
  const [mobHeader, setMobHeader] = useState(false);
  const [showBasket, setShowBasket] = useState(false);

  return (
    <>
      <Header
        setMobHeader={setMobHeader}
        setShowBasket={setShowBasket}
        mobHeader={mobHeader}
      />

      <div className="privacyContainer">
        <div className="privacyContent">
          <div className="privacy">
            <h1>მომსახურების პირობები</h1>
            <p>
              მიმომხილველი დოკუმენტი წარმოადგენს შეთანხმებას მომხმარებელსა და
              შპს „ბაზარიშინკას“ (შემდგომში – „კომპანია“) შორის, რომელიც
              არეგულირებს პლატფორმის გამოყენების, შეკვეთების განხორციელებისა და
              მიწოდების წესებს. კომპანიის ვებგვერდის გამოყენებით, მომხმარებელი
              ადასტურებს, რომ ეთანხმება მოცემულ პირობებს.
            </p>
          </div>
          <div className="privacy">
            <h1>1. კომპანიის იდენტობა</h1>
            <p>
              დასახელება: შპს „ბაზარიშინკა“ <br /> საიდენტიფიკაციო კოდი:
              (405698892 )
              <br /> მისამართი: თბილისი, მ. ალექსიძის 5
              <br /> ელ.ფოსტა: info@bazarishinka.ge
              <br />
              დირექტორი: დავით აბესაძე
            </p>
          </div>
          <div className="privacy">
            <h1>2. მომსახურების აღწერა</h1>
            <p>
              კომპანია მომხმარებელს სთავაზობს სხვადასხვა საკვებ პროდუქტის
              შეძენის შესაძლებლობას ონლაინ პლატფორმის მეშვეობით. შეკვეთების
              მიღება შესაძლებელია 24/7, ხოლო მიტანა ხორციელდება კომპანიის მიერ
              განსაზღვრულ ზონებში და დროის ფარგლებში.
            </p>
          </div>
          <div className="privacy">
            <h1>3. შეკვეთის განთავსება</h1>
            <p>
              მომხმარებელი ვალდებულია შეკვეთის დროს მიუთითოს სრული და ზუსტი
              ინფორმაცია (სახელი, გვარი, ტელეფონის ნომერი, მისამართი). შეკვეთა
              იძებნება მხოლოდ გადახდის დადასტურების შემდეგ. მომხმარებელი მიიღებს
              სატელეფონო დადასტურებას შეკვეთის შესახებ.
            </p>
          </div>
          <div className="privacy">
            <h1>4. გადახდის პირობები</h1>
            <p>
              გადახდა შესაძლებელია ფლიტის (Flitt) გადახდის სისტემის მეშვეობით,
              ბანკის ბარათით. ყველა ტრანზაქცია სრულდება დაცულ არხზე. თანხის
              ჩამოჭრა ხორციელდება მხოლოდ იმ შემთხვევაში, თუ შეკვეთა წარმატებით
              გაფორმდა.
            </p>
          </div>
          <div className="privacy">
            <h1>5. მიტანის პირობები</h1>
            <p>
              მიწოდება ხორციელდება მხოლოდ თბილისის მასშტაბით. მიტანის საფასური
              დამოკიდებულია მიწოდების ზონაზე. შეკვეთის მიწოდების დრო იცვლება
              მომხმარებლის ლოკაციის, დროის და გადატვირთულობის მიხედვით.
            </p>
          </div>
          <div className="privacy">
            <h1>6. დაბრუნებისა და გაუქმების პოლიტიკა</h1>
            <p>
              თუ პროდუქტი დაზიანებულია ან არასწორია, მომხმარებელს შეუძლია
              დაგვიკავშირდეს მიღებიდან 24 საათის განმავლობაში და მოითხოვოს
              შეცვლა ან ანაზღაურება. თანხის დაბრუნება ხორციელდება მხოლოდ იმ
              შემთხვევაში, თუ დადასტურდა კომპანიის ბრალეულობა.
            </p>
          </div>
          <div className="privacy">
            <h1>7. მომხმარებლის პასუხისმგებლობა</h1>
            <p>
              მომხმარებელი ვალდებულია გამოიყენოს პლატფორმა კანონიერად და
              კეთილსინდისიერად. აკრძალულია ყალბი ინფორმაციის მითითება,
              შეკვეთების განზრახ არასწორად გაფორმება და ნებისმიერი მავნე
              ქმედება.
            </p>
          </div>
          <div className="privacy">
            <h1>8. პერსონალური მონაცემების დაცვა</h1>
            <p>
              კომპანია იცავს მომხმარებლის პერსონალური მონაცემების
              კონფიდენციალურობას.
            </p>
          </div>
          <div className="privacy">
            <h1>9. ინტელექტუალური საკუთრება</h1>
            <p>
              ვებგვერდზე არსებული ყველა მასალა (ლოგო, ტექსტი, დიზაინი, ფოტოები)
              წარმოადგენს კომპანიის საკუთრებას და მისი გამოყენება აკრძალულია
              კომპანიის წინასწარი წერილობითი თანხმობის გარეშე.
            </p>
          </div>
          <div className="privacy">
            <h1>10. პირობების ცვლილება</h1>
            <p>
              კომპანია იტოვებს უფლებას ნებისმიერ დროს შეცვალოს მოცემული
              პირობები. ცვლილებები ძალაში შევა ვებგვერდზე გამოქვეყნებისთანავე.
              მომხმარებელი ვალდებულია პერიოდულად გაეცნოს პირობების განახლებულ
              ვერსიას.
            </p>
          </div>
        </div>
      </div>

      <Footer />
    </>
  );
}

export default Terms;
