import "./privacy.css";
import Header from "../../components/header/header";
import Footer from "../../components/footer/Footer";
import { useState } from "react";
function Privacy() {
  const [mobHeader, setMobHeader] = useState(false);
  const [showBasket, setShowBasket] = useState(false);

  return (
    <>
      <Header
        setMobHeader={setMobHeader}
        setShowBasket={setShowBasket}
        mobHeader={mobHeader}
      />

      <div className="privacyContainer">
        <div className="privacyContent">
          <div className="privacy">
            <h1>1. კომპანიის შესახებ</h1>
            <p>
              შპს ბაზარიშინკა არის საქართველოში, ქალაქ თბილისში რეგისტრირებული
              კომპანია, რომელიც მომხმარებლებს სთავაზობს საკვები პროდუქტების
              შეძენას ონლაინ პლატფორმის საშუალებით.
            </p>
          </div>
          <div className="privacy">
            <h1>2. რომელ მონაცემებს ვაგროვებთ</h1>
            <p>
              ჩვენ ვაგროვებთ მხოლოდ იმ მინიმალურ მონაცემებს, რაც საჭიროა
              შეკვეთის დამუშავებისა და მიტანისთვის: მომხმარებლის სახელი და
              გვარი, ტელეფონის ნომერი და საცხოვრებელი მისამართი (მიწოდების
              მიზნით)
            </p>
          </div>
          <div className="privacy">
            <h1>3. მონაცემთა გამოყენების მიზანი</h1>
            <p>
              მომხმარებლის მიერ მოწოდებული მონაცემები გამოიყენება შემდეგი
              მიზნებისთვის: შეკვეთის დამუშავება, მომხმარებლის იდენტიფიკაცია,
              პროდუქტის მიტანა სწორ მისამართზე. საჭიროების შემთხვევაში,
              შეკვეთასთან დაკავშირებული კითხვების მოგვარება. ჩვენ არ ვამუშავებთ
              არცერთ დამატებით მონაცემს, რომელიც არ არის აუცილებელი პროდუქტის
              მიწოდებისთვის.
            </p>
          </div>
          <div className="privacy">
            <h1>4. მესამე პირთან გაზიარება</h1>
            <p>
              კომპანია არ გადასცემს მომხმარებლის პერსონალურ მონაცემებს მესამე
              პირს რეკლამირების ან სხვა არაკანონიერი მიზნებისთვის. მონაცემები
              შესაძლოა გადაეცეს მხოლოდ მიტანის სერვისის პარტნიორს, როცა ეს
              აუცილებელია პროდუქტის დროულად და ზუსტად მიწოდებისთვის.
            </p>
          </div>
          <div className="privacy">
            <h1>5. მონაცემთა შენახვის ვადა</h1>
            <p>
              ჩვენ ვინახავთ მომხმარებლის მონაცემებს მხოლოდ იმ ვადით, რაც
              აუცილებელია შეკვეთის შესრულებისა და იურიდიული მოთხოვნების
              დასაკმაყოფილებლად. მონაცემების შენახვის დასრულების შემდეგ ისინი
              წაშლილი იქნება უსაფრთხო გზით.
            </p>
          </div>
          <div className="privacy">
            <h1>6. მომხმარებლის უფლებები</h1>
            <p>
              მომხმარებელს აქვს უფლება: მოითხოვოს ინფორმაცია, თუ რა მონაცემებს
              ვფლობთ მასზე, მოითხოვოს მონაცემების გასწორება ან წაშლა, შეწყვიტოს
              თანხმობა მონაცემთა დამუშავებაზე. მომხმარებლის მოთხოვნა დამუშავდება
              რაც შეიძლება სწრაფად, თუმცა არა უგვიანეს 10 სამუშაო დღის
              განმავლობაში.
            </p>
          </div>
          <div className="privacy">
            <h1>7. უსაფრთხოება</h1>
            <p>
              ჩვენ ვიყენებთ ყველა გონივრულ და ტექნოლოგიურად შესაბამის საშუალებას
              მომხმარებლის მონაცემთა დაცვისთვის: მონაცემების დაშიფვრა, დაცული
              სერვერები, წვდომის შეზღუდვა და ა.შ.
            </p>
          </div>
          <div className="privacy">
            <h1>8. ცვლილებები კონფიდენციალურობის პოლიტიკაში</h1>
            <p>
              კომპანიას შეუძლია დროდადრო განაახლოს კონფიდენციალურობის პოლიტიკა.
              ყველა ცვლილება გამოქვეყნდება ამავე გვერდზე, და ძალაში შევა
              გამოქვეყნებისთანავე.
            </p>
          </div>
          <div className="privacy">
            <section id="contact">
              {" "}
              <h1>9. საკონტაქტო ინფორმაცია</h1>
              <p>
                თუ გაქვთ კითხვები ან სურვილი, მიიღოთ ინფორმაცია პერსონალურ
                მონაცემებთან დაკავშირებით, დაგვიკავშირდით:
                <br /> ელ. ფოსტა: info@bazarishinka.ge
                <br /> ტელეფონი: +995 593 34 23 72
                <br /> მისამართი: თბილისი, მ. ალექსიძის 5
              </p>
            </section>
          </div>
        </div>
      </div>

      <Footer />
    </>
  );
}

export default Privacy;
